In [14]:
# imports
# remove warnings
import warnings
warnings.filterwarnings("ignore")
# import libraries
import numpy as np
from pydataset import data
import pandas as pd
# import sklearn
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier, plot_tree
from sklearn.metrics import classification_report
from sklearn.metrics import confusion_matrix
# import visualizations
import matplotlib.pyplot as plt
import seaborn as sns
# import useful files
import acquire
import prepare

1. Using the titanic data, in your classification-exercises repository, create a notebook, model.ipynb where you will do the following:

In [23]:
# aquire the titanic data
df = acquire.get_titanic_data()
df.head()

Let me get that for you...

,Unnamed: 0,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [25]:
# check data for discrepancies
df.info()
print('---------------------')
# check for missing values
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    891 non-null    int64
 1   passenger_id  891 non-null    int64
 2   survived      891 non-null    int64
 3   pclass        891 non-null    int64
 4   sex           891 non-null    object
 5   age           714 non-null    float64
 6   sibsp         891 non-null    int64
 7   parch         891 non-null    int64
 8   fare          891 non-null    float64
 9   embarked      889 non-null    object
 10  class         891 non-null    object
 11  deck          203 non-null    object
 12  embark_town   889 non-null    object
 13  alone         891 non-null    int64
dtypes: float64(2), int64(7), object(5)
memory usage: 97.6+ KB
---------------------

Unnamed: 0        0
passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          2
class             0
deck            688
embark_town       2
alone             0
dtype: int64

In [26]:
# prepare the titanic data
df = prepare.prep_titanic(df)
df.head()

Let me get that for you...

,survived,pclass,sibsp,parch,fare,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,3,1,0,7.2500,0,1,0,1
1,1,1,1,0,71.2833,0,0,0,0
2,1,3,0,0,7.9250,1,0,0,1
3,1,1,1,0,53.1000,0,0,0,1
4,0,3,0,0,8.0500,1,1,0,1

In [27]:
# check data for discrepancies
df.info()
print('---------------------')
# check for missing values
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   survived                 891 non-null    int64
 1   pclass                   891 non-null    int64
 2   sibsp                    891 non-null    int64
 3   parch                    891 non-null    int64
 4   fare                     891 non-null    float64
 5   alone                    891 non-null    int64
 6   sex_male                 891 non-null    uint8
 7   embark_town_Queenstown   891 non-null    uint8
 8   embark_town_Southampton  891 non-null    uint8
dtypes: float64(1), int64(5), uint8(3)
memory usage: 44.5 KB
---------------------

survived                   0
pclass                     0
sibsp                      0
parch                      0
fare                       0
alone                      0
sex_male                   0
embark_town_Queenstown     0
embark_town_Southampton    0
dtype: int64

In [31]:
# split the titanic data
train, validate, test = prepare.split_titanic_data(df)
print(train.shape, validate.shape, test.shape)
print('---------------------')
print(train.info())

(498, 9) (214, 9) (179, 9)
---------------------
<class 'pandas.core.frame.DataFrame'>
Int64Index: 498 entries, 789 to 104
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   survived                 498 non-null    int64
 1   pclass                   498 non-null    int64
 2   sibsp                    498 non-null    int64
 3   parch                    498 non-null    int64
 4   fare                     498 non-null    float64
 5   alone                    498 non-null    int64
 6   sex_male                 498 non-null    uint8
 7   embark_town_Queenstown   498 non-null    uint8
 8   embark_town_Southampton  498 non-null    uint8
dtypes: float64(1), int64(5), uint8(3)
memory usage: 28.7 KB
None

In [33]:
# split the sample variables in X and y
# y_*: Series, target variable
# X_*: DataFrame, features
y_train = train.survived
X_train = train.drop(columns=['survived', 'sex_male'])

# create x and y validate
X_validate = validate.drop(columns=['survived', 'sex_male'])
y_validate = validate.survived

# create x and y test
X_test = test.drop(columns=['survived', 'sex_male'])
y_test = test.survived

1. What is your baseline prediction? What is your baseline accuracy? 

remember: your baseline prediction for a classification problem is predicting the most prevelant class in the training dataset (the mode). When you make those predictions, what is your accuracy? This is your baseline accuracy.

In [34]:
# check the y_train data
y_train.value_counts()

0    307
1    191
Name: survived, dtype: int64